/*
 * HW3.c
 *
 *  Created on: 3 окт. 2019 г.
 *      Author: wolfm
 */


#include "Works.h"
#include <stdio.h>

#define TCount 3

void HW3_Task1();
void HW3_Task2();
void HW3_Task3();

void HW3_main(){
	Task tasks[TCount] = {
				{
						.Number = 1,
						.ToDo = "Попробовать оптимизировать пузырьковую сортировку. \nСравнить количество операций сравнения оптимизированной и не оптимизированной программы. \nНаписать функции сортировки, которые возвращают количество операций.",
						.func = HW3_Task1
				},
				{
						.Number = 2,
						.ToDo = "Реализовать шейкерную сортировку.",
						.func = HW3_Task2
				},
				{
						.Number = 3,
						.ToDo = "Погуглить как осуществляется Pigeon Hole Sort и попробовать реализовать на языке С.",
						.func = HW3_Task3
				}
		};

	TaskMenu(tasks,TCount);

	int userInput=0;
	printf("Введите команду задачи: ");
	scanf("%d",&userInput);

	PlayTask(userInput, TCount, tasks);
}

/*//////////////////////////////////////////////////////////////////////////////////////
 *  1.
 *  Попробовать оптимизировать пузырьковую сортировку.
 *  Сравнить количество операций сравнения оптимизированной и не оптимизированной программы.
 *  Написать функции сортировки, которые возвращают количество операций.
*/
void HW3_Task1(){

}

/*//////////////////////////////////////////////////////////////////////////////////////
 *  2.
 *  Реализовать шейкерную сортировку.
*/
void HW3_Task2(){

}

/*//////////////////////////////////////////////////////////////////////////////////////
 *  3. optional.
 *  Погуглить как осуществляется Pigeon Hole Sort и попробовать реализовать на языке С.
*/
void HW3_Task3(){

}
